IDEA StatiCa Open Model
MatPrestressSteelSIA.Type Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of prestress steel
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public PrestressSteelTypeSIA Type { get; set; }
Public Property Type As PrestressSteelTypeSIA
	Get
	Set
public:
property PrestressSteelTypeSIA Type {
	PrestressSteelTypeSIA get ();
	void set (PrestressSteelTypeSIA value);
}
Property Value
Type: PrestressSteelTypeSIA
See Also
Reference
MatPrestressSteelSIA Class
IdeaRS.OpenModel.Material Namespace